app/controllers/books_controller.rb

SELECT * FROM "books" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "books"
---
  def index
    @books = Book.paginate :page => params[:page], :per_page => 5

SELECT * FROM "books" WHERE ("books"."id" = 1)
SELECT * FROM "comments" WHERE ("comments".book_id = 1) ORDER BY created_at ASC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "comments" WHERE ("comments".book_id = 1)
---
  def show
    @book = Book.find(params[:id])
    @comments = @book.comments.paginate :page => params[:page], :per_page => 3, :order=> 'created_at ASC'

INSERT INTO "books" ("created_at", "title", "updated_at", "thoughts") VALUES('2010-04-08 15:56:28', 'True Colors', '2010-04-08 15:56:28', 'Pretty bad ass')
---
  def create
    @book = Book.new params[:book]
    if @book.save

SELECT * FROM "books" WHERE ("books"."id" = 17)
---
  def edit
    @book = Book.find params[:id]

SELECT * FROM "books" WHERE ("books"."id" = 17)
UPDATE "books" SET "updated_at" = '2010-04-08 16:05:06', "thoughts" = 'Pretty bad ass!' WHERE "id" = 17
---
  def update
    @book = Book.find params[:id]
    if @book.update_attributes(params[:book])

SELECT * FROM "books" WHERE ("books"."id" = 16)
DELETE FROM "books" WHERE "id" = 16
---
  def destroy
    book = Book.find params[:id]
    book.destroy